app/controllers/comments_controller.rb

SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 3))
---
  def show
    # @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])

INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "commenter") VALUES('2010-03-25 07:15:38', 'this article blows a bunch of gobbers', '2010-03-25 07:15:38', 3, 'moneyBBBBB')
---
  def create
    # @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    if @comment.save

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
---
  def find_comment
    @post = Post.find(params[:post_id])