app/controllers/events_controller.rb

  def show
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "price", "created_at", "starts_at", "updated_at", "description", "capacity") VALUES('Dollar Index Change', 0.0, '2010-03-31 04:36:53', '2010-03-31 04:18:00', '2010-03-31 04:36:53', 'Dollar index goes higher. ', 0)

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)
UPDATE "events" SET "updated_at" = '2010-03-31 14:03:07', "starts_at" = '2010-04-10 05:10:00' WHERE "id" = 4

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = 2)
DELETE FROM "events" WHERE "id" = 2

  def copy
    event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)