app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM "posts"

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "created_at", "title", "updated_at", "content") VALUES('BrettU', '2010-04-06 17:52:16', 'Classes in HAML', '2010-04-06 17:52:16', '<p>I was having this issue the other day trying to get a unique javaScript class attribute to stick in HAML. HAML versus writing HTML is nice and easy in my opinion and it seems like it is saving a ton of time messing around with closing tags. This was my experience —

  def update
    #@post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
UPDATE "posts" SET "updated_at" = '2010-03-25 07:09:35', "title" = 'this is a first post', "content" = 'bunch of dunny text' WHERE "id" = 1

  def find_post
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)